Revit 2027 API
ThermalAsset.SpecificHeatOfVaporization Property
 The specific heat of vaporization of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SpecificHeatOfVaporization { get; set; }
Public Property SpecificHeatOfVaporization As Double
	Get
	Set
public:
property double SpecificHeatOfVaporization {
	double get ();
	void set (double value);
}
member SpecificHeatOfVaporization : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for specificHeatOfVaporization must be non-negative.
Remarks
 Values are in feet per squared-second (ft/s²) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace